# Tasks

In [43]:
#Your task is to create a Python script that analyzes the records to calculate each of the following:\

#The total number of months included in the dataset.
#The net total amount of Profit/Losses over the entire period.
#The average of the changes in Profit/Losses over the entire period.
#The greatest increase in profits (date and amount) over the entire period.
#The greatest decrease in losses (date and amount) over the entire period.

### Import Libraries and dependencies

In [44]:
# Import libraries and dependencies
# Import libraries and dependencies
import pandas as pd
import numpy as np
from pathlib import Path

### Read CSV in as DataFrame

In [45]:
# Set the path
# Set the file path
#file_path = Path(r"C:\Users\ikili\Downloads\budget_data")

#reading file as csv
# Read in the CSV as a DataFrame
dfg=pd.read_csv('budget_data.csv')

In [46]:
#Using head to view data briefly
dfg.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

## Task (i):  The total number of months included in the dataset.

In [47]:
# Create a new DataFrame by splitting the text content of a column
split_Date = dfg["Date"].str.split("-", expand=True)

In [48]:
#Using head to view data briefly
split_Date.head()

     0     1
0  Jan  2010
1  Feb  2010
2  Mar  2010
3  Apr  2010
4  May  2010

In [49]:
# Add two new columns to the `split_Date` using the columns created after splitting the `Date` column
dfg["Month"] = split_Date[0]
dfg["Year"] = split_Date[1]

In [50]:
#Using head to view data briefly
split_Date.head()

     0     1
0  Jan  2010
1  Feb  2010
2  Mar  2010
3  Apr  2010
4  May  2010

In [51]:
dfg.head()

       Date  Profit/Losses Month  Year
0  Jan-2010         867884   Jan  2010
1  Feb-2010         984655   Feb  2010
2  Mar-2010         322013   Mar  2010
3  Apr-2010         -69417   Apr  2010
4  May-2010         310503   May  2010

In [52]:
### Delete column "Date"

In [53]:
#finding the columns of dataframe 'dfg'
dfg.columns

Index(['Date', 'Profit/Losses', 'Month', 'Year'], dtype='object')

In [54]:
# Use the `drop` method to delete a column from the 'split_Date'
##dfg= dfg.drop(columns=['Date'])

In [55]:
dfg.head()

       Date  Profit/Losses Month  Year
0  Jan-2010         867884   Jan  2010
1  Feb-2010         984655   Feb  2010
2  Mar-2010         322013   Mar  2010
3  Apr-2010         -69417   Apr  2010
4  May-2010         310503   May  2010

In [56]:
dfg.groupby(dfg.Month).agg("count")

       Date  Profit/Losses  Year
Month
Apr       7              7     7
Aug       7              7     7
Dec       7              7     7
Feb       8              8     8
Jan       8              8     8
Jul       7              7     7
Jun       7              7     7
Mar       7              7     7
May       7              7     7
Nov       7              7     7
Oct       7              7     7
Sep       7              7     7

In [57]:
np.unique(dfg['Month'])

array(['Apr', 'Aug', 'Dec', 'Feb', 'Jan', 'Jul', 'Jun', 'Mar', 'May',
       'Nov', 'Oct', 'Sep'], dtype=object)

In [58]:
dfg.shape

(86, 4)

In [59]:
dfg.describe()

       Profit/Losses
count   8.600000e+01
mean    4.463090e+05
std     5.363579e+05
min    -1.196225e+06
25%     1.821620e+05
50%     5.703280e+05
75%     7.952262e+05
max     1.170593e+06

In [60]:
dfg.count()

Date             86
Profit/Losses    86
Month            86
Year             86
dtype: int64

In [61]:
#Total number of months included:86

In [62]:
Total_num_months=dfg['Date'].count()

## Task (ii): The net total amount of Profit/Losses over the entire period.

In [63]:
dfg.head()

       Date  Profit/Losses Month  Year
0  Jan-2010         867884   Jan  2010
1  Feb-2010         984655   Feb  2010
2  Mar-2010         322013   Mar  2010
3  Apr-2010         -69417   Apr  2010
4  May-2010         310503   May  2010

### Method I

In [64]:
dfg.columns

Index(['Date', 'Profit/Losses', 'Month', 'Year'], dtype='object')

In [65]:
#Finding data type for columns
dfg.dtypes

Date             object
Profit/Losses     int64
Month            object
Year             object
dtype: object

In [66]:
sum_profit=0
sum_loss=0
Total_PL=0

In [67]:
for item in dfg["Profit/Losses"]:
    if item>0:
        sum_profit=sum_profit+item
    elif item<0:
        sum_loss=sum_loss+item
total_PL=sum_profit+sum_loss # keeping plus sign because loss is in minus sign

In [68]:
sum_profit

45710004

In [69]:
sum_loss

-7327426

In [70]:
total_PL

38382578

### Method II (one step, without for loop)

In [71]:
#using numpy 
total=np.sum(dfg["Profit/Losses"])

In [73]:
total

38382578

## Task (iii): The average of the changes in Profit/Losses over the entire period.
## Task (iv): The greatest increase in profits (date and amount) over the entire period.
## Task (v): The greatest decrease in losses (date and amount) over the entire period.

### Method I

In [74]:
dfg["change"]=dfg["Profit/Losses"].diff()

In [75]:
dfg.head()

       Date  Profit/Losses Month  Year    change
0  Jan-2010         867884   Jan  2010       NaN
1  Feb-2010         984655   Feb  2010  116771.0
2  Mar-2010         322013   Mar  2010 -662642.0
3  Apr-2010         -69417   Apr  2010 -391430.0
4  May-2010         310503   May  2010  379920.0

In [76]:
#finding the average of change column : Answer fo task 3

In [77]:
dfg["change"].mean()

-2315.1176470588234

In [78]:
#finding the  maximum value in change column : Answer for task 4

In [79]:
dfg["change"].max()

1926159.0

In [80]:
#finding the minimum value in change column : Answer for task 5

In [81]:
dfg["change"].min()

-2196167.0

### Method II

In [82]:
#creating a list out of column 'Profit/Losses'
profitLossesList = list(dfg['Profit/Losses'])

#creating an empty list
changeList = []

#initializing a variable
counter = 0

#creating a numpy array
numDB = np.array(profitLossesList)

In [83]:
#using for loop to iterate through the values over the years
for i in range(len(dfg)-1):
    #to find current position while iterating
    current = profitLossesList[i]
    #to find position next to current value to compare it with 
    current_before = profitLossesList[i+1]
    #appending their differences in a list
    changeList.append(current_before-current)
    #Finding minimum value in the list (over the years)
    minimum_Change = min(changeList)
    #Finding maximum value in the list (over the years)
    maximum_Change = max(changeList)  
    #Fiding average value in the list (ober the years)
    average_Chance = round(np.mean(changeList),2)

# Printing out the Output for all Tasks

In [84]:

print(f"\nFinancial Analysis\n----------------------------------\n")
print(f"Your profit is: ${total}")
print(f"Total Months {Total_num_months}")
print(f"Average  Change: ${average_Chance}")
print(f"Greatest Increase in Profits: (${maximum_Change})")
print(f"Greatest Decrease in Profits: (${minimum_Change})")

Financial Analysis
----------------------------------

Your profit is: $38382578
Total Months 86
Average  Change: $-2315.12
Greatest Increase in Profits: ($1926159)
Greatest Decrease in Profits: ($-2196167)